ibGraduateWork/src/AccountingRegisters/Хозрасчетный/Хозрасчетный.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccountingRegister>
  <name>Хозрасчетный</name>
  <chartOfAccounts>ChartOfAccounts.Хозрасчетный</chartOfAccounts>
  <correspondence>true</correspondence>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
    <accountingFlag>ChartOfAccounts.Хозрасчетный.AccountingFlag.Количественный</accountingFlag>
  </resources>
  <resources>
    <name>Сумма</name>
    <type>
      <types>DefinedType.Деньги</types>
    </type>
    <balance>true</balance>
    <extDimensionAccountingFlag>ChartOfAccounts.Хозрасчетный.ExtDimensionAccountingFlag.Суммовой</extDimensionAccountingFlag>
  </resources>
  <resources>
    <name>СуммаВалюта</name>
    <type>
      <types>DefinedType.Деньги</types>
    </type>
    <accountingFlag>ChartOfAccounts.Хозрасчетный.AccountingFlag.Валютный</accountingFlag>
  </resources>
</mdclass:AccountingRegister>

ibGraduateWork/src/ChartsOfAccounts/Хозрасчетный/Хозрасчетный.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:ChartOfAccounts>
  <name>Хозрасчетный</name>
  <extDimensionTypes>ChartOfCharacteristicTypes.ВидыСубконто</extDimensionTypes>
  <predefined>
    <items>
      <name>Товары</name>
      <description>Товары</description>
      <code>41</code>
      <childItems>
        <name>ТоварыНаСкладах</name>
        <description>Товары на складах</description>
        <code>41.01</code>
      </childItems>
    </items>
    <items>
      <name>Касса</name>
      <description>Касса</description>
      <code>50</code>
      <childItems>
        <name>КассаОрганизации</name>
        <description>Касса организации</description>
        <code>50.01</code>
      </childItems>
      <childItems>
        <name>КассаОрганизацииВал</name>
        <description>Касса организации (в валюте)</description>
        <code>50.02</code>
      </childItems>
    </items>
    <items>
      <name>РасчетныеСчета</name>
      <description>Расчетные счета</description>
      <code>51</code>
    </items>
    <items>
      <name>ВалютныеСчета</name>
      <description>Валютные счета</description>
      <code>52</code>
    </items>
    <items>
      <name>РасчетыСПоставщикамиИПодрядчиками</name>
      <description>Расчеты с поставщиками и подрядчикам</description>
      <code>60</code>
      <accountType>ActivePassive</accountType>
      <childItems>
        <name>РасчетыСПоставщиками</name>
        <description>Расчеты с поставщиками</description>
        <code>60.01</code>
        <accountType>Passive</accountType>
      </childItems>
      <childItems>
        <name>РасчетыПоАвансамВыданным</name>
        <description>Расчеты по авансам выданным</description>
        <code>60.02</code>
      </childItems>
    </items>
    <items>
      <name>РасчетыСПокупателямиИЗаказчиками</name>
      <description>Расчеты с покупателями и заказчиками</description>
      <code>62</code>
      <accountType>ActivePassive</accountType>
      <childItems>
        <name>РасчетыСПокупателями</name>
        <description>Расчеты с покупателями</description>
        <code>62.01</code>
      </childItems>
      <childItems>
        <name>РасчетыПоАвансамПолученным</name>
        <description>Расчеты по авансам полученным</description>
        <code>62.02</code>
        <accountType>Passive</accountType>
      </childItems>
    </items>
    <items>
      <name>Продажи</name>
      <description>Продажи</description>
      <code>90</code>
      <accountType>ActivePassive</accountType>
      <childItems>
        <name>Выручка</name>
        <description>Выручка</description>
        <code>90.01</code>
        <accountType>Passive</accountType>
      </childItems>
      <childItems>
        <name>СебестоимостьПродаж</name>
        <description>Себестоимость продаж</description>
        <code>90.02</code>
      </childItems>
    </items>
  </predefined>
  <accountingFlags>
    <name>Количественный</name>
    <type>
      <types>Boolean</types>
    </type>
  </accountingFlags>
  <accountingFlags>
    <name>Валютный</name>
    <type>
      <types>Boolean</types>
    </type>
  </accountingFlags>
  <extDimensionAccountingFlags>
    <name>Суммовой</name>
    <type>
      <types>Boolean</types>
    </type>
  </extDimensionAccountingFlags>
</mdclass:ChartOfAccounts>

ibGraduateWork/src/ChartsOfCharacteristicTypes/ВидыСубконто/ВидыСубконто.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:ChartOfCharacteristicTypes>
  <name>ВидыСубконто</name>
  <type>
    <types>DocumentRef.ПоступлениеТоваров</types>
    <types>CatalogRef.Контрагенты</types>
    <types>CatalogRef.Договоры</types>
    <types>CatalogRef.Склады</types>
    <types>CatalogRef.Валюты</types>
    <types>CatalogRef.Номенклатура</types>
    <types>CatalogRef.СчетаОрганизации</types>
  </type>
  <predefined>
    <items>
      <name>Валюта</name>
      <description>Валюта</description>
      <code>000000007</code>
      <type>
        <types>CatalogRef.Валюты</types>
      </type>
    </items>
    <items>
      <name>Договор</name>
      <description>Договор</description>
      <code>000000004</code>
      <type>
        <types>CatalogRef.Договоры</types>
      </type>
    </items>
    <items>
      <name>Контрагент</name>
      <description>Контрагент</description>
      <code>000000003</code>
      <type>
        <types>CatalogRef.Контрагенты</types>
      </type>
    </items>
    <items>
      <name>Номенклатура</name>
      <description>Номенклатура</description>
      <code>000000002</code>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </items>
    <items>
      <name>Партия</name>
      <description>Партия</description>
      <code>000000006</code>
      <type>
        <types>DocumentRef.ПоступлениеТоваров</types>
      </type>
    </items>
    <items>
      <name>Склад</name>
      <description>Склад</description>
      <code>000000001</code>
      <type>
        <types>CatalogRef.Склады</types>
      </type>
    </items>
    <items>
      <name>СчетОрганизации</name>
      <description>Счет организации</description>
      <code>000000005</code>
      <type>
        <types>CatalogRef.СчетаОрганизации</types>
      </type>
    </items>
  </predefined>
</mdclass:ChartOfCharacteristicTypes>

ibGraduateWork/src/CommonModules/ДокументКассовыйОрдерСервер/Module.bsl
// Функция - Заполнить
// Заполняет документ кассового ордера на основе документов заказа или поступления товаров.
// Параметры:
//  Документ		 - ДокументОбъект - Документ который нужно заполнить.
//  ДокументОснова	 - ДокументСсылка - Документ с данныим заполнения.
Процедура Заполнить(Документ, ДокументОснова = Неопределено) Экспорт 
	Если ДокументОснова <> Неопределено Тогда
		ТипДокОснов = ТипЗнч(ДокументОснова);
		
		ЗаполнитьДок = (
			ТипДокОснов = Тип("ДокументСсылка.ЗаказКлиента") Или ТипДокОснов = Тип("ДокументСсылка.РеализацияТоваров") Или
			ТипДокОснов = Тип("ДокументСсылка.ЗаказПоставщику") Или ТипДокОснов = Тип("ДокументСсылка.ПоступлениеТоваров")
		); 
		
		Если ЗаполнитьДок Тогда
			Документ.Основание	  = ДокументОснова.Ссылка;
			Документ.Контрагент	  = ДокументОснова.Контрагент; 
			Документ.Договор	  = ДокументОснова.Договор;
			Документ.Валюта		  = ДокументОснова.Валюта;
			Документ.СуммаКОплате = ДокументОснова.ИтоговаяСумма;
			Документ.Сумма 		  = ДокументОснова.ИтоговаяСумма;
		КонецЕсли;
	КонецЕсли;
	Если Документ.Метаданные().Реквизиты.Найти("СчетОрганизации") <> Неопределено Тогда
		Документ.СчетОрганизации = Константы.ОсновнойСчетОрганизации.Получить();
	КонецЕсли;	
КонецПроцедуры

Процедура ПровестиРасход(Документ, Отказ) Экспорт
	Движения = Документ.Движения;
	Движения.Хозрасчетный.Записывать = Истина;
	Движение = Движения.Хозрасчетный.Добавить();
	Движение.Период = Документ.Дата; 
	
	Движение.СчетДт = ПланыСчетов.Хозрасчетный.РасчетыСПоставщиками;
	Движение.СубконтоДт[ПланыВидовХарактеристик.ВидыСубконто.Контрагент] = Документ.Контрагент;
	Движение.СубконтоДт[ПланыВидовХарактеристик.ВидыСубконто.Договор] = Документ.Договор; 
	
	Валюта = Документ.Валюта;
	ВалютаУчета = Константы.ВалютаУчета.Получить();
	БезналичныйПлатеж = ТипЗнч(Документ) = Тип("ДокументОбъект.СписаниеСРасчетногоСчета");
	Если Валюта = ВалютаУчета Тогда
		Движение.СчетКт = ?(БезналичныйПлатеж, ПланыСчетов.Хозрасчетный.РасчетныеСчета, ПланыСчетов.Хозрасчетный.КассаОрганизации);
		Движение.Сумма = Документ.Сумма;
	Иначе
		Движение.СчетКт = ?(БезналичныйПлатеж, ПланыСчетов.Хозрасчетный.ВалютныеСчета, ПланыСчетов.Хозрасчетный.КассаОрганизацииВал);
		Движение.СубконтоКт[ПланыВидовХарактеристик.ВидыСубконто.Валюта] = Валюта;
		Движение.СуммаВалютаКт = Документ.Сумма;
		КоэффКонверт = СервисВызовСервера.ПолучитьКоэффициентПереводаВалютыВУчетнуюВалюту(Валюта, Документ.Дата, Истина, Отказ);
		Движение.Сумма = Документ.Сумма * КоэффКонверт;	
	КонецЕсли;
	Если БезналичныйПлатеж Тогда
		Движение.СубконтоКт[ПланыВидовХарактеристик.ВидыСубконто.СчетОрганизации] = Документ.СчетОрганизации;
	КонецЕсли;
КонецПроцедуры

Процедура ПровестиПриход(Документ, Отказ) Экспорт 
	Движения = Документ.Движения;
	Движения.Хозрасчетный.Записывать = Истина;
	Движение = Движения.Хозрасчетный.Добавить();
	Движение.Период = Документ.Дата;
	
	Валюта = Документ.Валюта;
	ВалютаУчета = Константы.ВалютаУчета.Получить();
	БезналичныйПлатеж = ТипЗнч(Документ) = Тип("ДокументОбъект.ПоступлениеНаРасчетныйСчет");
	Если Валюта = ВалютаУчета Тогда
		Движение.СчетДт = ?(БезналичныйПлатеж, ПланыСчетов.Хозрасчетный.РасчетныеСчета, ПланыСчетов.Хозрасчетный.КассаОрганизации);
		Движение.Сумма = Документ.Сумма;
	Иначе 
		Движение.СчетДт = ?(БезналичныйПлатеж, ПланыСчетов.Хозрасчетный.ВалютныеСчета, ПланыСчетов.Хозрасчетный.КассаОрганизацииВал);
		Движение.СубконтоДт[ПланыВидовХарактеристик.ВидыСубконто.Валюта] = Валюта;
		Движение.СуммаВалютаДт = Документ.Сумма;
		КоэффКонверт = СервисВызовСервера.ПолучитьКоэффициентПереводаВалютыВУчетнуюВалюту(Валюта, Документ.Дата, Истина, Отказ);
		Движение.Сумма = Документ.Сумма * КоэффКонверт;
	КонецЕсли;
	Если БезналичныйПлатеж Тогда
		Движение.СубконтоДт[ПланыВидовХарактеристик.ВидыСубконто.СчетОрганизации] = Документ.СчетОрганизации;
    КонецЕсли;
		
	Движение.СчетКт = ПланыСчетов.Хозрасчетный.РасчетыСПокупателями;
	Движение.СубконтоКт[ПланыВидовХарактеристик.ВидыСубконто.Контрагент] = Документ.Контрагент;
	Движение.СубконтоКт[ПланыВидовХарактеристик.ВидыСубконто.Договор] = Документ.Договор;	
КонецПроцедуры


Процедура ОснованиеПриИзменении(Объект) Экспорт
	Основание = Объект.Основание;
	Объект.Контрагент 	= Основание.Контрагент;
	Объект.Договор 		= Основание.Договор;
	Объект.Валюта 		= Основание.Валюта;
	Объект.СуммаКОплате = Основание.ИтоговаяСумма;
КонецПроцедуры
